БИТУправление_медицинским_центром_демо/src/Catalogs/НастройкиПоискаКлиентов/НастройкиПоискаКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиПоискаКлиентов</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпоновщикНастроекОсновнойСхемы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаРасположенияОтборов</name>
    <type>
      <types>EnumRef.ВидыНастроекРасположенияОтборовФормыПодбораКлиентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиОтдельныхСхемКомпоновки</name>
    <attributes>
      <name>ИмяСхемы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиКомпоновки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыНастроекРасположенияОтборовФормыПодбораКлиентов/ВидыНастроекРасположенияОтборовФормыПодбораКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНастроекРасположенияОтборовФормыПодбораКлиентов</name>
  <enumValues>
    <name>НаНесколькихСтраницах</name>
  </enumValues>
  <enumValues>
    <name>НаОднойСтранице</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/НастройкиПоискаКлиентов/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Пользователь) Тогда 
		ЭтотОбъект.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.НастройкаРасположенияОтборов) Тогда 
		ЭтотОбъект.НастройкаРасположенияОтборов = Перечисления.ВидыНастроекРасположенияОтборовФормыПодбораКлиентов.НаНесколькихСтраницах;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
